Part4_PatternCreation/ch12_af.md
```mermaid
classDiagram
    class Computer {
        cpu: CPU
        memory: Memory
        mb: MotherBoard
        make() void
    }
    Computer ..> PC_CPU : creates
    Computer ..> PC_Memory : creates
    Computer ..> PC_MotherBoard : creates
```
