Part4_PatternCreation/af2.puml
```plantuml
@startuml
class Computer {
  cpu: CPU
  memory: Memory
  mb: MotherBoard
  ---
  void make()
}

class PC
Computer <|-- PC
class Workstation
Computer <|-- Workstation


Computer o- CPU : creates
Computer o- Memory : creates
Computer o- MotherBoard : creates

MotherBoard <|-- PCMotherBoard
MotherBoard <|-- WorkstationMotherBoard
CPU <|-- PC_CPU
CPU <|-- Workstation_CPU
Memory <|--- PC_Memory
Memory <|--- Workstation_Memory

@enduml
```
