Part4_PatternCreation/ch12_af.md
```mermaid
classDiagram
    class Computer {
        cpu: CPU
        memory: Memory
        mb: MotherBoard
        make() void
    }
    Computer ..> WorkstationCPU : creates
    Computer ..> WorkstationMemory : creates
    Computer ..> WorkstationMotherBoard : creates
```
